<template>
  <pre class="neutral-color">
    ### **1. Семантичне версіонування (`1.0.1`)**
    Формат: **`MAJOR.MINOR.PATCH`**
    - **MAJOR** – значні зміни (можлива несумісність з попередніми версіями).
    - **MINOR** – новий функціонал, зворотно сумісний.
    - **PATCH** – виправлення багів, малі зміни.

    Приклад:
    - `1.0.0` – перший стабільний реліз.
    - `1.1.0` – додано новий функціонал.
    - `1.1.1` – виправлення дрібних помилок.



    ### **2. Пре-релізні версії (`alpha`, `beta`)**
    - `1.0.0-alpha` – рання тестова версія.
    - `1.0.0-beta` – версія, готова для тестування.
    - `1.0.0-rc.1` – реліз-кандидат перед стабільною версією.
  </pre>
</template>
